export default {
  /* कैमरा-स्क्रीन */
  camera: {
    description: 'क्या 4 कोने दिखाई दे रहे हैं?',
    left_foot: 'बायाँ पैर',
    right_foot: 'दायाँ पैर',
    serviceHotline: '+49 176 14831775',
    serviceDescription: 'मापन में समस्या है? हमें कॉल करें!',
    loadingMessage: 'छवि का मूल्यांकन कर रहा है',
    error: {
      title: {
        "0": "ओह, पत्र को पहचाना नहीं गया...",
        "10": "ओह, सभी कोने पहचाने नहीं गए...",
        "11": "ओह, सतह पत्र पहचान के लिए उपयुक्त नहीं है...",
        "20": "ओह, पत्र को पहचाना नहीं गया...",
    },
      text: {
        "0": 'कृपया सुनिश्चित करें कि'
      },
      list: {
        "0": "सभी चार कोने दिख रहे हैं",
        "1": "फोटो अच्छे से प्रकाशित है",
        "2": "पृष्ठभूमि पत्र से पृष्ठभूमि से भिन्न है"
      },
      button: 'समझ गया'
    },
    /* ?-पॉप-अप-स्क्रीन कैमरा */
    modal: {
      buttons: {
        continue: 'जारी रखें',
        close: 'बंद करें',
      },
      buttonSecondary: {
        headline: 'मापन में समस्या है?',
        text: 'हमें कॉल करें: +49 176 14831775',
        link: 'tel:+4917614831775'
      },
      slides: [
        {
          video: '/videos/camera-intro-1-en.mp4',
          items: [
            {
              text: '**DIN A4 पत्र** (कोई नोटपैड या समकक्ष नहीं) एक समतल सतह पर',
              icon: 'document'
            },
            {
              text: '**कुर्सी के सामने की किनारे पर बैठें**',
              icon: 'sitting'
            },
            {
              text: '**अपने मोजे निकालें** और पैंट ऊपर करें',
              icon: 'sock'
            }
          ],
        },
        {
          video: '/videos/camera-intro-2-en.mp4',
          items: [
            {
              text: 'अपना पैर पत्र पर रखें',
              icon: 'foot'
            },
            {
              text: 'अपने फोन को अपने घुटनों के बीच में रखें और पैर की ओर लक्ष्य बनाएं',
              icon: 'phone'
            },
            {
              text: '**क्या सभी 4 कोने दिख रहे हैं?** फोटो लें :-)',
              icon: 'camera'
            }
          ],
        },
      ]
    },
  },
  /* सुधार-स्क्रीन */
  review: {
    title: "सुधार",
    loadingMessage: 'पैर के आयाम की गणना हो रही है...',
    serviceHotline: '+49 176 14831775',
    serviceDescription: 'मापन में समस्या है? हमें कॉल करें!',
    alert0: 'आपका स्कैन अब उपलब्ध नहीं है। कृपया एक नया स्कैन लें :-)',
    alert1: 'ओह, कुछ गलत हो गया। हमें एक और मौका दें और फिर से कोशिश करें :-)',
    /* निर्देश-स्क्रीन */
    modal: {
      buttons: {
        continue: 'जारी रखें',
        close: 'बंद करें',
      },
      slides: [
        {
          video: '/videos/review-intro-en.mp4',
          items: [
            {
              text: '**पैर से पत्र के संकेतक** क्या बिल्कुल पैर के संकेतक पर हैं?',
              icon: 'target'
            },
            {
              text: 'आप **संकेतकों को छूने और ले जाने में आसानी से स्थानांतरित कर सकते हैं**।',
              icon: 'touch'
            }
          ],
        }
      ]
    },
    acceptButton: 'खत्म'
  },
  /* परिणाम पृष्ठ */
  result: {
    headline: 'सिफारिश की गई जूती का साइज',
    alert0: 'कोई स्कैन उपलब्ध नहीं है',
    alert1: 'कृपया अपना नाम और ईमेल पता दर्ज करें',
    alert2: 'खाता बनाने में त्रुटि',
    for: 'के लिए',
    length: 'लम्बाई',
    width: 'चौड़ाई',
    back_to_shop_button: 'वापस दुकान पर',
    back_to_shop_no_reg_button: "आईडी सहेजे बिना खरीददारी जारी रखें",
    manage_scans_text: 'अपने पिछले स्कैन को प्रबंधित करें',
    manage_scans_button: 'स्कैन प्रबंधित करें',
    model: 'मॉडल',
    brand: 'ब्रांड',
    no_value: 'कोई जानकारी नहीं',
    no_matching_size: 'ऐसा लगता है कि यह जूता आपके साइज़ में उपलब्ध नहीं है।',
    registration: {
      id: 'अगले बार के लिए अपना आईडी सहेजें',
      email: 'ईमेल दर्ज करें',
      name: 'अपना खुद का आईडी बनाएं',
      description: ' ',
      button: 'इनपुट्स सहेजें'
    }
  },
  footer: {
    legal_notice: 'कानूनी सूचना',
    privacy_policy: 'गोपनीयता नीति'
  },
  faq: {
    title_tag: 'सामान्य प्रश्न',
    headline: 'जूता कहां दब रहा है?',
    description: 'यहां आपके प्रश्नों के सामान्य उत्तर मिलेंगे।',
    items: [
      {
        question: 'mySHOEFITTER किस प्रकार का एप्लिकेशन है?',
        content: 'एक बार अपने पैर का स्कैन करें और हमेशा पूरी तरह से सही जूते का साइज़ ऑर्डर करें - mySHOEFITTER साइज़ डिटर्मिनेशन के लिए स्वचालित जूते का साइज़ बताने के लिए परिपूर्ण एप्लिकेशन है। हमारे एप्लिकेशन के साथ, आप अपने चुने गए जूते के लिए पूरी तरह से मिलता जुलता साइज़ पा सकते हैं।'
      },
      {
        question: 'डिजिटल जूते का साइज सलाह कैसे काम करता है?',
        content: 'अपने सही जूते का साइज़ पाने के लिए, हमें आपके पैर की एक फोटो की आवश्यकता होती है। हमारे artificial intelligence का उपयोग करके हम आपके पैर का माप लेते हैं और आपके पैर के आयामों और संबंधित जूते के आंतरिक आयामों के आधार पर सही जूते का साइज़ निर्धारित करते हैं। जूते के साइज़ स्टैंडर्ड नहीं होते, इसलिए जूते हमेशा साइज़ में अंतर करते हैं। सबसे अच्छी बात यह है कि आपको केवल एक बार स्कैन करना होता है। इसके बाद, आप जेनरेट किए गए आईडी का उपयोग करके हमेशा सीधे सही साइज़ की जूते ऑर्डर कर सकते हैं।'
      },
      {
        question: 'मापन कितने समय लगता है?',
        content: 'पूरे प्रक्रिया का आयोजन लगभग 2 मिनट का होता है।'
      },
      {
        question: 'मेरे पैर को मापने के लिए किस बात का ध्यान देना चाहिए?',
        content: 'हमारी AI को एक सफेद A4 पत्र पर आपके नगे पैर की एक छवि की आवश्यकता है। यह महत्वपूर्ण है कि पत्र एक सीधी सतह पर हो (कोई कारपेट या समकक्ष नहीं) और सभी चार कोने भूमि पर समतल हो (कोई मुड़ा हुआ पत्र या निकलते कोने नहीं होने चाहिए)। मापन के दौरान, सभी चार कोने भी दिखने चाहिए। अपने पूरे पैर, आपके हील सहित, को दिखाएं। हम सुझाव देते हैं कि मापन बैठकर करें, क्योंकि यह सबसे आरामदायक होता है। स्कैन करते समय अपने पैर पर वजन डालें क्योंकि आपके पैर हमेशा थोड़ा बड़ा होता है जब वजन उठाते हैं।'
      },
      {
        question: 'मैं मापन करते समय अपना स्मार्टफोन कैसे पकड़ना चाहिए?',
        content: 'बैठकर, अपना स्मार्टफोन अपने घुटनों के बीच में हल्के से एक कोण पर पकड़ें, और अपने पैर की ओर झुकाकर रखें। इस तरह, आपके पूरे पैर (हील सहित) के साथ पत्र के सभी चार कोने दिखाई देने चाहिए।'
      },
      {
        question: 'mySHOEFITTER से मेरे लाभ क्या हैं?',
        content: 'अपने जूते को सीधे सही साइज़ में ऑर्डर करके, आप संभावित रिटर्न लागत से बच सकते हैं। इसके अलावा, हर रिटर्न के लिए आप लगभग 30 मिनट अपने कीमती समय की बचत करते हैं, अगर आपको जूते को पोस्ट ऑफिस वापस लौटाने की आवश्यकता नहीं होती। आप ऐसे ही संभावित प्रत्यापनों से बचते हैं, जिन्हें आपको वापस पोस्ट ऑफिस ले जाने की आवश्यकता नहीं होती। इसके अलावा, आप अप्रत्याशित सीओ2 उत्सर्जन (प्रत्यापन प्रति 500 ग्राम) और बहुत सारे पैकेजिंग कचरे से बचते हैं। आखिरकार, आप अपनी पसंदीदा दुकान का समर्थन करते हैं क्योंकि उच्च प्रत्यापन लागतों का सच में दुकानों को बड़ा नुकसान होता है।'
      },
      {
        question: 'मेरा पैर पत्र से बड़ा है, मैं क्या कर सकता हूँ?',
        content: 'कोई समस्या नहीं। आपका पैर पत्र के सामने उबर सकता है; हम फिर भी आपके पैर को माप सकते हैं। बस यह सुनिश्चित करें कि पैर पिछवाड़े पर नहीं बढ़ता है।'
      },
      {
        question: 'मेरे दो अलग-अलग साइज़ के पैर हैं, मैं किसे मापना चाहिए?',
        content: 'केवल स्लाइट विभिनतताओं के लिए, आप अपने बड़े पैर को माप सकते हैं। अगर आपके पैर वाकई बहुत भिन्न हैं, तो दोनों पैर को मापें। बड़ी भिन्नताओं के लिए, आपको अपने आर्थोपेडिस्ट से बात करनी चाहिए।'
      },
      {
        question: 'मेरे पैर में गांठदारता है, क्या मैं फिर भी mySHOEFITTER का उपयोग कर सकता हूँ?',
        content: 'आप अपने पैर में गांठदारता के बावजूद हमारे एप्लिकेशन का उपयोग कर सकते हैं। हालांकि, हम सीरियस समस्याओं के बावजूद आमतौर पर आर्थोपेडिस्ट के पास जाने और आपके लिए तैयार किए गए जूते और/या विशेष इनसोल किए जाने की सलाह देते हैं।'
      },
      {
        question: 'मापन काम नहीं कर रहा है, मैं क्या कर सकता हूँ?',
        content: 'लगभग सभी मामलों में, इसलिए है क्योंकि पत्र को सही तरीके से पहचाना नहीं गया था (सभी कोने दिखाई नहीं देते हैं या पृष्ठभूमि के साथ बहुत कम विभिन्नता है)। यह महत्वपूर्ण है कि पत्र अच्छे से प्रकाशित हो और अंधकार में नहीं हो। सुनिश्चित करें कि आपका पूरा पैर दिखाई देता है। अगर फिर भी काम नहीं करता है, तो कृपया हमसे संपर्क करें और अपनी समस्या की स्क्रीनशॉट या स्क्रीन रिकॉर्डिंग वीडियो भेजें।'
      },
    ]
  }
}
